---

C#Visual BasicVisual C++

Revit 2024 API
---
ComboBoxMemberData Constructor
ComboBoxMemberData Class See Also Send Feedback
---

Constructs a new instance of ComboBoxMemberData.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011

# Syntax

C#
---

    public ComboBoxMemberData(
    	string name,
    	string text
    )

Visual Basic
---

    Public Sub New ( _
    	name As String, _
    	text As String _
    )

Visual C++
---

    public:
    ComboBoxMemberData(
    	String^ name,
    	String^ text
    )

#### Parameters

name
    Type: System..::..StringThe internal name of the ComboBoxMember.

text
    Type: System..::..StringThe user visible text seen on the item.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when nullNothingnullptra null reference (Nothing in Visual Basic) is passed for one or more arguments. |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when an empty string is passed for one or more arguments. |

# See Also

ComboBoxMemberData Class

Autodesk.Revit.UI Namespace